ALPHA-BLOG/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
    def index
        @articles = Article.paginate(page: params[:page], per_page: 5)

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Ruby on rails"], ["description", "this demo mashur's article"], ["created_at", "2022-03-21 11:07:45.044491"], ["updated_at", "2022-03-21 11:07:45.044491"], ["user_id", 7]]
---
    def create
        @article = Article.new(article_params)
        # render plain: @article.inspect

        @article.user = current_user

       if @article.save

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "description of second artilcle- editedjdj"], ["updated_at", "2022-03-16 10:43:45.028247"], ["id", 2]]
---
    def update
        # @article = Article.find(params[:id])
       if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 21]]
---
    def destroy
        # @article = Article.find(params[:id])
        @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_articles
        @article = Article.find(params[:id])