ALPHA-BLOG/app/controllers/categories_controller.rb

    def index
        @categories = Category.paginate(page: params[:page], per_page: 5)
---
SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

    def create
        @category = Category.new(category_params)

        if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sport"], ["created_at", "2022-03-22 05:22:32.782543"], ["updated_at", "2022-03-22 05:22:32.782543"]]