ALPHA-BLOG/app/controllers/users_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
    def show
        @articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
      def index
        @users = User.paginate(page: params[:page], per_page: 3)

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "mark@gmail.com"], ["password_digest", "$2a$12$nRQZ94QO4VFAq3Ef1fMizerR8lRZ2TMQdKomwTSPyV2iqW2Y5UVBm"], ["updated_at", "2022-03-17 10:42:18.884971"], ["id", 3]]
---
      def update

        if @user.update(user_params)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save